# Taps
#tap 'homebrew/cask-fonts'
#tap 'homebrew/cask-versions'
#tap 'homebrew/bundle'
#tap 'ashur/pug'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
#brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
#brew 'hub' # github
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
#brew 'stripe/stripe-cli/stripe'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
#brew 'zlib' # Needed for Memcached
#brew 'pug' # for maintaining multiple local git repo
brew 'svn' # Needed to install fonts
brew 'zsh-syntax-highlighting' # syntax hightlight for zsh


# Development
brew 'php'
brew 'php@8.2'
brew 'php@8.3'
brew 'composer'
brew 'imagemagick'
brew 'neovim'
brew 'node'
brew 'sqlite'
brew 'yarn'
brew 'npm'

# Apps
cask 'atom'
cask 'bitwarden'
cask 'caffeine'
cask 'docker'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'herd'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'phpstorm'
cask 'qbittorrent'
cask 'raycast'
cask 'sequel-ace'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'surfshark'
cask 'the-unarchiver'
cask 'there'
cask 'transmit'
cask 'visual-studio-code'
#cask 'virtualbox'
#cask 'virtualbox-extension-pack'
cask 'vlc'


# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Amphetamine', id: 937984704
#mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984
#mas 'Irvue Wallpaper changer', id: 1039633667
#mas 'Keynote', id: 409183694
#mas 'Numbers', id: 409203825
#mas 'RescueTime', id: 966285407
#mas 'Spark', id: 1176895641
