# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'ashur/pug'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'pug' # for maintaining multiple local git repo

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.4'
brew 'php@7.3'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'neovim'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'sqlite'
brew 'yarn'
brew 'npm'

# Apps
cask 'alfred'
cask 'atom'
cask 'aerial'
cask 'bitwarden'
cask 'caffeine'
cask 'docker'
cask 'evernote'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'imageoptim'
cask 'insomnia'
cask 'istat-menus'
cask 'macs-fan-control'
cask 'mysqlworkbench'
cask 'phpstorm'
cask 'qbittorrent'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'sequel-ace'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'there'
cask 'transmission'
cask 'transmit'
cask 'visual-studio-code'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984
mas 'Irvue Wallpaper changer', id: 1039633667
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'RescueTime', id: 966285407
mas 'Spark', id: 1176895641
mas 'Speedtest', id: 1153157709


